betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Include/apm32f4xx_ddl_i2c.h
/**
  *
  * @file    apm32f4xx_ddl_i2c.h
  * @brief   Header file of I2C DDL module.
  *
  * @attention
  *
  * Redistribution and use in source and binary forms, with or without modification, 
  * are permitted provided that the following conditions are met:
  *
  * 1. Redistributions of source code must retain the above copyright notice,
  *    this list of conditions and the following disclaimer.
  * 2. Redistributions in binary form must reproduce the above copyright notice,
  *    this list of conditions and the following disclaimer in the documentation
  *    and/or other materials provided with the distribution.
  * 3. Neither the name of the copyright holder nor the names of its contributors
  *    may be used to endorse or promote products derived from this software without
  *    specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
  * ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
  * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
  * IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
  * INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
  * BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
  * DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF
  * LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE
  * OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED
  * OF THE POSSIBILITY OF SUCH DAMAGE.
  * The original code has been modified by Geehy Semiconductor.
  * Copyright (c) 2016 STMicroelectronics. Copyright (C) 2023-2025 Geehy Semiconductor.
  * All rights reserved.
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef APM32F4xx_DDL_I2C_H
#define APM32F4xx_DDL_I2C_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "apm32f4xx.h"

/** @addtogroup APM32F4xx_DDL_Driver
  * @{
  */

#if defined (I2C1) || defined (I2C2) || defined (I2C3)

/** @defgroup I2C_DDL I2C
  * @{
  */

/* Private types -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/

/* Private constants ---------------------------------------------------------*/
/** @defgroup I2C_DDL_Private_Constants I2C Private Constants
  * @{
  */

/* Defines used to perform compute and check in the macros */
#define DDL_I2C_MAX_SPEED_STANDARD           100000U
#define DDL_I2C_MAX_SPEED_FAST               400000U
/**
  * @}
  */

/* Private macros ------------------------------------------------------------*/
#if defined(USE_FULL_DDL_DRIVER)
/** @defgroup I2C_DDL_Private_Macros I2C Private Macros
  * @{
  */
/**
  * @}
  */
#endif /*USE_FULL_DDL_DRIVER*/

/* Exported types ------------------------------------------------------------*/
#if defined(USE_FULL_DDL_DRIVER)
/** @defgroup I2C_DDL_ES_INIT I2C Exported Init structure
  * @{
  */
typedef struct
{
  uint32_t PeripheralMode;      /*!< Specifies the peripheral mode.
                                     This parameter can be a value of @ref I2C_DDL_EC_PERIPHERAL_MODE

                                     This feature can be modified afterwards using unitary function @ref DDL_I2C_SetMode(). */

  uint32_t ClockSpeed;          /*!< Specifies the clock frequency.
                                     This parameter must be set to a value lower than 400kHz (in Hz)

                                     This feature can be modified afterwards using unitary function @ref DDL_I2C_SetClockPeriod()
                                     or @ref DDL_I2C_SetDutyCycle() or @ref DDL_I2C_SetClockSpeedMode() or @ref DDL_I2C_ConfigSpeed(). */

  uint32_t DutyCycle;           /*!< Specifies the I2C fast mode duty cycle.
                                     This parameter can be a value of @ref I2C_DDL_EC_DUTYCYCLE

                                     This feature can be modified afterwards using unitary function @ref DDL_I2C_SetDutyCycle(). */

#if defined(I2C_FILTER_ANFDIS) && defined(I2C_FILTER_DNFCFG)
  uint32_t AnalogFilter;        /*!< Enables or disables analog noise filter.
                                     This parameter can be a value of @ref I2C_DDL_EC_ANALOGFILTER_SELECTION

                                     This feature can be modified afterwards using unitary functions @ref DDL_I2C_EnableAnalogFilter() or DDL_I2C_DisableAnalogFilter(). */

  uint32_t DigitalFilter;       /*!< Configures the digital noise filter.
                                     This parameter can be a number between Min_Data = 0x00 and Max_Data = 0x0F

                                     This feature can be modified afterwards using unitary function @ref DDL_I2C_SetDigitalFilter(). */

#endif /* I2C_FILTER_ANFDIS && I2C_FILTER_DNFCFG */
  uint32_t OwnAddress1;         /*!< Specifies the device own address 1.
                                     This parameter must be a value between Min_Data = 0x00 and Max_Data = 0x3FF

                                     This feature can be modified afterwards using unitary function @ref DDL_I2C_SetOwnAddress1(). */

  uint32_t TypeAcknowledge;     /*!< Specifies the ACKnowledge or Non ACKnowledge condition after the address receive match code or next received byte.
                                     This parameter can be a value of @ref I2C_DDL_EC_I2C_ACKNOWLEDGE

                                     This feature can be modified afterwards using unitary function @ref DDL_I2C_AcknowledgeNextData(). */

  uint32_t OwnAddrSize;         /*!< Specifies the device own address 1 size (7-bit or 10-bit).
                                     This parameter can be a value of @ref I2C_DDL_EC_OWNADDRESS1

                                     This feature can be modified afterwards using unitary function @ref DDL_I2C_SetOwnAddress1(). */
} DDL_I2C_InitTypeDef;
/**
  * @}
  */
#endif /*USE_FULL_DDL_DRIVER*/

/* Exported constants --------------------------------------------------------*/
/** @defgroup I2C_DDL_Exported_Constants I2C Exported Constants
  * @{
  */

/** @defgroup I2C_DDL_EC_GET_FLAG Get Flags Defines
  * @brief    Flags defines which can be used with DDL_I2C_ReadReg function
  * @{
  */
#define DDL_I2C_STS1_STARTFLG    I2C_STS1_STARTFLG    /*!< Start Bit (master mode)                   */
#define DDL_I2C_STS1_ADDRFLG     I2C_STS1_ADDRFLG     /*!< Address sent (master mode) or
                                                        Address matched flag (slave mode)         */
#define DDL_I2C_STS1_BTCFLG      I2C_STS1_BTCFLG      /*!< Byte Transfer Finished flag               */
#define DDL_I2C_STS1_ADDR10FLG   I2C_STS1_ADDR10FLG   /*!< 10-bit header sent (master mode)          */
#define DDL_I2C_STS1_STOPFLG     I2C_STS1_STOPFLG     /*!< Stop detection flag (slave mode)          */
#define DDL_I2C_STS1_RXBNEFLG    I2C_STS1_RXBNEFLG    /*!< Data register not empty (receivers)       */
#define DDL_I2C_STS1_TXBEFLG     I2C_STS1_TXBEFLG     /*!< Data register empty (transmitters)        */
#define DDL_I2C_STS1_BERRFLG     I2C_STS1_BERRFLG     /*!< Bus error                                 */
#define DDL_I2C_STS1_ALFLG       I2C_STS1_ALFLG       /*!< Arbitration lost                          */
#define DDL_I2C_STS1_AEFLG       I2C_STS1_AEFLG       /*!< Acknowledge failure flag                  */
#define DDL_I2C_STS1_OVRURFLG    I2C_STS1_OVRURFLG    /*!< Overrun/Underrun                          */
#define DDL_I2C_STS1_PECEFLG     I2C_ISR_PECERR       /*!< PEC Error in reception (SMBus mode)       */
#define DDL_I2C_STS1_TTEFLG      I2C_ISR_TIMEOUT      /*!< Timeout detection flag (SMBus mode)       */
#define DDL_I2C_STS1_SMALERT     I2C_ISR_SMALERT      /*!< SMBus alert (SMBus mode)                  */
#define DDL_I2C_STS2_MSFLG       I2C_STS2_MSFLG       /*!< Master/Slave flag                         */
#define DDL_I2C_STS2_BUSBSYFLG   I2C_STS2_BUSBSYFLG   /*!< Bus busy flag                             */
#define DDL_I2C_STS2_TRFLG       I2C_STS2_TRFLG       /*!< Transmitter/receiver direction            */
#define DDL_I2C_STS2_GENCALLFLG  I2C_STS2_GENCALLFLG  /*!< General call address (Slave mode)         */
#define DDL_I2C_STS2_SMBDADDRFLG I2C_STS2_SMBDADDRFLG /*!< SMBus Device default address (Slave mode) */
#define DDL_I2C_STS2_SMMHADDR    I2C_STS2_SMMHADDR    /*!< SMBus Host address (Slave mode)           */
#define DDL_I2C_STS2_DUALADDRFLG I2C_STS2_DUALADDRFLG /*!< Dual flag  (Slave mode)                   */
/**
  * @}
  */

/** @defgroup I2C_DDL_EC_IT IT Defines
  * @brief    IT defines which can be used with DDL_I2C_ReadReg and  DDL_I2C_WriteReg functions
  * @{
  */
#define DDL_I2C_CTRL2_EVIEN                   I2C_CTRL2_EVIEN          /*!< Events interrupts enable */
#define DDL_I2C_CTRL2_BUFIEN                  I2C_CTRL2_BUFIEN         /*!< Buffer interrupts enable */
#define DDL_I2C_CTRL2_ERRIEN                  I2C_CTRL2_ERRIEN         /*!< Error interrupts enable  */
/**
  * @}
  */

#if defined(I2C_FILTER_ANFDIS)
/** @defgroup I2C_DDL_EC_ANALOGFILTER_SELECTION  Analog Filter Selection
  * @{
  */
#define DDL_I2C_ANALOGFILTER_ENABLE          0x00000000U             /*!< Analog filter is enabled. */
#define DDL_I2C_ANALOGFILTER_DISABLE         I2C_FILTER_ANFDIS       /*!< Analog filter is disabled.*/
/**
  * @}
  */

#endif
/** @defgroup I2C_DDL_EC_OWNADDRESS1 Own Address 1 Length
  * @{
  */
#define DDL_I2C_OWNADDRESS1_7BIT             0x00004000U                                  /*!< Own address 1 is a 7-bit address.   */
#define DDL_I2C_OWNADDRESS1_10BIT            (uint32_t)(I2C_SADDR1_ADDRLEN | 0x00004000U) /*!< Own address 1 is a 10-bit address.  */
/**
  * @}
  */

/** @defgroup I2C_DDL_EC_DUTYCYCLE Fast Mode Duty Cycle
  * @{
  */
#define DDL_I2C_DUTYCYCLE_2                  0x00000000U             /*!< I2C fast mode Tlow/Thigh = 2        */
#define DDL_I2C_DUTYCYCLE_16_9               I2C_CLKCTRL_FDUTYCFG    /*!< I2C fast mode Tlow/Thigh = 16/9     */
/**
  * @}
  */

/** @defgroup I2C_DDL_EC_CLOCK_SPEED_MODE Master Clock Speed Mode
  * @{
  */
#define DDL_I2C_CLOCK_SPEED_STANDARD_MODE    0x00000000U             /*!< Master clock speed range is standard mode */
#define DDL_I2C_CLOCK_SPEED_FAST_MODE        I2C_CLKCTRL_SPEEDCFG    /*!< Master clock speed range is fast mode     */
/**
  * @}
  */

/** @defgroup I2C_DDL_EC_PERIPHERAL_MODE Peripheral Mode
  * @{
  */
#define DDL_I2C_MODE_I2C                     0x00000000U                                                       /*!< I2C Master or Slave mode                                    */
#define DDL_I2C_MODE_SMBUS_HOST              (uint32_t)(I2C_CTRL1_SMBEN | I2C_CTRL1_SMBTCFG | I2C_CTRL1_ARPEN) /*!< SMBus Host address acknowledge                              */
#define DDL_I2C_MODE_SMBUS_DEVICE            I2C_CTRL1_SMBEN                                                   /*!< SMBus Device default mode (Default address not acknowledge) */
#define DDL_I2C_MODE_SMBUS_DEVICE_ARP        (uint32_t)(I2C_CTRL1_SMBEN | I2C_CTRL1_ARPEN)                     /*!< SMBus Device Default address acknowledge                    */
/**
  * @}
  */

/** @defgroup I2C_DDL_EC_I2C_ACKNOWLEDGE Acknowledge Generation
  * @{
  */
#define DDL_I2C_ACK                          I2C_CTRL1_ACKEN      /*!< ACK is sent after current received byte. */
#define DDL_I2C_NACK                         0x00000000U          /*!< NACK is sent after current received byte.*/
/**
  * @}
  */

/** @defgroup I2C_DDL_EC_DIRECTION Read Write Direction
  * @{
  */
#define DDL_I2C_DIRECTION_WRITE              I2C_STS2_TRFLG       /*!< Bus is in write transfer */
#define DDL_I2C_DIRECTION_READ               0x00000000U          /*!< Bus is in read transfer  */
/**
  * @}
  */

/**
  * @}
  */

/* Exported macro ------------------------------------------------------------*/
/** @defgroup I2C_DDL_Exported_Macros I2C Exported Macros
  * @{
  */

/** @defgroup I2C_DDL_EM_WRITE_READ Common Write and read registers Macros
  * @{
  */

/**
  * @brief  Write a value in I2C register
  * @param  __INSTANCE__ I2C Instance
  * @param  __REG__ Register to be written
  * @param  __VALUE__ Value to be written in the register
  * @retval None
  */
#define DDL_I2C_WriteReg(__INSTANCE__, __REG__, __VALUE__) WRITE_REG(__INSTANCE__->__REG__, (__VALUE__))

/**
  * @brief  Read a value in I2C register
  * @param  __INSTANCE__ I2C Instance
  * @param  __REG__ Register to be read
  * @retval Register value
  */
#define DDL_I2C_ReadReg(__INSTANCE__, __REG__) READ_REG(__INSTANCE__->__REG__)
/**
  * @}
  */

/** @defgroup I2C_DDL_EM_Exported_Macros_Helper Exported_Macros_Helper
  * @{
  */

/**
  * @brief  Convert Peripheral Clock Frequency in Mhz.
  * @param  __PCLK__ This parameter must be a value of peripheral clock (in Hz).
  * @retval Value of peripheral clock (in Mhz)
  */
#define __DDL_I2C_FREQ_HZ_TO_MHZ(__PCLK__)                               (uint32_t)((__PCLK__)/1000000U)

/**
  * @brief  Convert Peripheral Clock Frequency in Hz.
  * @param  __PCLK__ This parameter must be a value of peripheral clock (in Mhz).
  * @retval Value of peripheral clock (in Hz)
  */
#define __DDL_I2C_FREQ_MHZ_TO_HZ(__PCLK__)                               (uint32_t)((__PCLK__)*1000000U)

/**
  * @brief  Compute I2C Clock rising time.
  * @param  __FREQRANGE__ This parameter must be a value of peripheral clock (in Mhz).
  * @param  __SPEED__ This parameter must be a value lower than 400kHz (in Hz).
  * @retval Value between Min_Data=0x02 and Max_Data=0x3F
  */
#define __DDL_I2C_RISE_TIME(__FREQRANGE__, __SPEED__)                    (uint32_t)(((__SPEED__) <= DDL_I2C_MAX_SPEED_STANDARD) ? ((__FREQRANGE__) + 1U) : ((((__FREQRANGE__) * 300U) / 1000U) + 1U))

/**
  * @brief  Compute Speed clock range to a Clock Control Register (I2C_CLKCTRL_CLKS) value.
  * @param  __PCLK__ This parameter must be a value of peripheral clock (in Hz).
  * @param  __SPEED__ This parameter must be a value lower than 400kHz (in Hz).
  * @param  __DUTYCYCLE__ This parameter can be one of the following values:
  *         @arg @ref DDL_I2C_DUTYCYCLE_2
  *         @arg @ref DDL_I2C_DUTYCYCLE_16_9
  * @retval Value between Min_Data=0x004 and Max_Data=0xFFF, except in FAST DUTY mode where Min_Data=0x001.
  */
#define __DDL_I2C_SPEED_TO_CCR(__PCLK__, __SPEED__, __DUTYCYCLE__)       (uint32_t)(((__SPEED__) <= DDL_I2C_MAX_SPEED_STANDARD)? \
                                                                                  (__DDL_I2C_SPEED_STANDARD_TO_CCR((__PCLK__), (__SPEED__))) : \
                                                                                  (__DDL_I2C_SPEED_FAST_TO_CCR((__PCLK__), (__SPEED__), (__DUTYCYCLE__))))

/**
  * @brief  Compute Speed Standard clock range to a Clock Control Register (I2C_CLKCTRL_CLKS) value.
  * @param  __PCLK__ This parameter must be a value of peripheral clock (in Hz).
  * @param  __SPEED__ This parameter must be a value lower than 100kHz (in Hz).
  * @retval Value between Min_Data=0x004 and Max_Data=0xFFF.
  */
#define __DDL_I2C_SPEED_STANDARD_TO_CCR(__PCLK__, __SPEED__)             (uint32_t)(((((__PCLK__)/((__SPEED__) << 1U)) & I2C_CLKCTRL_CLKS) < 4U)? 4U:((__PCLK__) / ((__SPEED__) << 1U)))

/**
  * @brief  Compute Speed Fast clock range to a Clock Control Register (I2C_CLKCTRL_CLKS) value.
  * @param  __PCLK__ This parameter must be a value of peripheral clock (in Hz).
  * @param  __SPEED__ This parameter must be a value between Min_Data=100Khz and Max_Data=400Khz (in Hz).
  * @param  __DUTYCYCLE__ This parameter can be one of the following values:
  *         @arg @ref DDL_I2C_DUTYCYCLE_2
  *         @arg @ref DDL_I2C_DUTYCYCLE_16_9
  * @retval Value between Min_Data=0x001 and Max_Data=0xFFF
  */
#define __DDL_I2C_SPEED_FAST_TO_CCR(__PCLK__, __SPEED__, __DUTYCYCLE__)  (uint32_t)(((__DUTYCYCLE__) == DDL_I2C_DUTYCYCLE_2)? \
                                                                            (((((__PCLK__) / ((__SPEED__) * 3U)) & I2C_CLKCTRL_CLKS) == 0U)? 1U:((__PCLK__) / ((__SPEED__) * 3U))) : \
                                                                            (((((__PCLK__) / ((__SPEED__) * 25U)) & I2C_CLKCTRL_CLKS) == 0U)? 1U:((__PCLK__) / ((__SPEED__) * 25U))))

/**
  * @brief  Get the Least significant bits of a 10-Bits address.
  * @param  __ADDRESS__ This parameter must be a value of a 10-Bits slave address.
  * @retval Value between Min_Data=0x00 and Max_Data=0xFF
  */
#define __DDL_I2C_10BIT_ADDRESS(__ADDRESS__)                             ((uint8_t)((uint16_t)((__ADDRESS__) & (uint16_t)(0x00FF))))

/**
  * @brief  Convert a 10-Bits address to a 10-Bits header with Write direction.
  * @param  __ADDRESS__ This parameter must be a value of a 10-Bits slave address.
  * @retval Value between Min_Data=0xF0 and Max_Data=0xF6
  */
#define __DDL_I2C_10BIT_HEADER_WRITE(__ADDRESS__)                        ((uint8_t)((uint16_t)((uint16_t)(((uint16_t)((__ADDRESS__) & (uint16_t)(0x0300))) >> 7) | (uint16_t)(0xF0))))

/**
  * @brief  Convert a 10-Bits address to a 10-Bits header with Read direction.
  * @param  __ADDRESS__ This parameter must be a value of a 10-Bits slave address.
  * @retval Value between Min_Data=0xF1 and Max_Data=0xF7
  */
#define __DDL_I2C_10BIT_HEADER_READ(__ADDRESS__)                         ((uint8_t)((uint16_t)((uint16_t)(((uint16_t)((__ADDRESS__) & (uint16_t)(0x0300))) >> 7) | (uint16_t)(0xF1))))

/**
  * @}
  */

/**
  * @}
  */

/* Exported functions --------------------------------------------------------*/

